number_1 = str(input('введите первое число: '))
number_2 = str(input('введите второе число: '))
number_3 = str(input('введите третье число: '))
str_ = number_1 + ' ' + number_2 + ' ' + number_3
print(min(str_.split()))
# Напишите ваше решение
